//
//  communication.h
//  TestC
//
//  Created by issuser on 2022/11/22.
//

#ifndef communication_h
#define communication_h

/*
 假如有10台电脑
 可通信的电脑编号为5组,用户输入可相互通信的电脑编号组合:
 {1, 2}
 {1, 3}
 {5, 8}
 {6, 7}
 {5, 7}

 ********

 第1次输入{1, 2}后
 可通信的电脑编号组合为: {1, 2}
 第2次输入{1, 3}后
 可通信的电脑编号组合为: {1, 2, 3} // 1和2可相互通信,1和3可相互通信=>{2, 3}可相互通信,所以{1, 2, 3}之间可相互通信
 第3次输入{5, 8}后
 可通信的电脑编号组合为: {1, 2, 3}, {5, 8}
 第4次输入{6, 7}后
 可通信的电脑编号组合: {1, 2, 3}, {5, 8}, {6, 7}
 第5次输入{5, 7}后
 可通信的电脑编号组合为 {1, 2, 3}，{5, 8, 7}, {6, 7, 5} // 5和8可相互通信,5和7可相互通信,可得出{8, 7}可相互通信,所以{5, 8, 7}之间可相互通信, 同理可得{6, 7, 5可相互通信}

 分组合并的问题:
 {5, 8, 7}组合内部可相互通信, {6, 7, 5}组合内部可相互通信
 {5, 8, 7}和{6, 7, 5} 两个组合, 组合间有重复元素{5, 7},
 {5,7}和8之间可相互通信, {5,7}和6之间可相互通信, 可得出{6, 8}之间可通信,所以{5, 6, 7, 8}之间可相互通信
 所以最后的可通信的电脑编号组合为: {1, 2, 3}, {5, 6, 7, 8}, 即:
 {1, 2, 3}之间可相互通信
 {5, 6, 7, 8}之间可相互通信

 考察知识点:scanf()函数,for循环,数组(二维数组)
 */
void test1(void);
void test2(void);

#endif /* communication_h */
